Ran Plan for project: `rds-prod` dir: `terraform/rds` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # aws_db_parameter_group.main will be updated in-place
~ resource "aws_db_parameter_group" "main" {
        id           = "prod-shared-mysql-params"
        name         = "prod-shared-mysql-params"
        tags         = {
            "CostCenter"  = "engineering"
            "DataClass"   = "sensitive"
            "Description" = "Shared MySQL database for multiple services"
            "Environment" = "prod"
            "Lifecycle"   = "production"
            "ManagedBy"   = "Terraform"
            "Name"        = "prod-shared-mysql-params"
            "Owner"       = "platform-team@ryuqqq.com"
            "Project"     = "shared-infrastructure"
            "Service"     = "shared-database"
            "Stack"       = "rds"
            "Team"        = "platform-team"
        }
        # (7 unchanged attributes hidden)

      - parameter {
          - apply_method = "pending-reboot" -> null
          - name         = "innodb_buffer_pool_size" -> null
          - value        = "{DBInstanceClassMemory*3/4}" -> null
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "innodb_buffer_pool_size"
          + value        = "{DBInstanceClassMemory*3/4}"
        }

        # (6 unchanged blocks hidden)
    }

  # aws_ssm_parameter.db-instance-address will be created
+ resource "aws_ssm_parameter" "db-instance-address" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "RDS instance hostname for cross-stack references"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/shared/rds/db-instance-address"
      + region         = "ap-northeast-2"
      + tags           = {
          + "Component"   = "rds"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "sensitive"
          + "Description" = "Shared MySQL database for multiple services"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "db-instance-address-export"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Project"     = "shared-infrastructure"
          + "Service"     = "shared-database"
          + "Stack"       = "rds"
          + "Team"        = "platform-team"
        }
      + tags_all       = {
          + "Component"   = "rds"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "sensitive"
          + "Description" = "Shared MySQL database for multiple services"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "db-instance-address-export"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Project"     = "shared-infrastructure"
          + "Service"     = "shared-database"
          + "Stack"       = "rds"
          + "Team"        = "platform-team"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.db-instance-id will be created
+ resource "aws_ssm_parameter" "db-instance-id" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "RDS instance identifier for cross-stack references"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/shared/rds/db-instance-id"
      + region         = "ap-northeast-2"
      + tags           = {
          + "Component"   = "rds"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "sensitive"
          + "Description" = "Shared MySQL database for multiple services"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "db-instance-id-export"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Project"     = "shared-infrastructure"
          + "Service"     = "shared-database"
          + "Stack"       = "rds"
          + "Team"        = "platform-team"
        }
      + tags_all       = {
          + "Component"   = "rds"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "sensitive"
          + "Description" = "Shared MySQL database for multiple services"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "db-instance-id-export"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Project"     = "shared-infrastructure"
          + "Service"     = "shared-database"
          + "Stack"       = "rds"
          + "Team"        = "platform-team"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.db-instance-port will be created
+ resource "aws_ssm_parameter" "db-instance-port" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "RDS instance port for cross-stack references"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/shared/rds/db-instance-port"
      + region         = "ap-northeast-2"
      + tags           = {
          + "Component"   = "rds"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "sensitive"
          + "Description" = "Shared MySQL database for multiple services"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "db-instance-port-export"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Project"     = "shared-infrastructure"
          + "Service"     = "shared-database"
          + "Stack"       = "rds"
          + "Team"        = "platform-team"
        }
      + tags_all       = {
          + "Component"   = "rds"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "sensitive"
          + "Description" = "Shared MySQL database for multiple services"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "db-instance-port-export"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Project"     = "shared-infrastructure"
          + "Service"     = "shared-database"
          + "Stack"       = "rds"
          + "Team"        = "platform-team"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.db-security-group-id will be created
+ resource "aws_ssm_parameter" "db-security-group-id" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "RDS security group ID for cross-stack references"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/shared/rds/db-security-group-id"
      + region         = "ap-northeast-2"
      + tags           = {
          + "Component"   = "rds"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "sensitive"
          + "Description" = "Shared MySQL database for multiple services"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "db-security-group-id-export"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Project"     = "shared-infrastructure"
          + "Service"     = "shared-database"
          + "Stack"       = "rds"
          + "Team"        = "platform-team"
        }
      + tags_all       = {
          + "Component"   = "rds"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "sensitive"
          + "Description" = "Shared MySQL database for multiple services"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "db-security-group-id-export"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Project"     = "shared-infrastructure"
          + "Service"     = "shared-database"
          + "Stack"       = "rds"
          + "Team"        = "platform-team"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.master-password-secret-name will be created
+ resource "aws_ssm_parameter" "master-password-secret-name" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "RDS master password secret name for cross-stack references"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/shared/rds/master-password-secret-name"
      + region         = "ap-northeast-2"
      + tags           = {
          + "Component"   = "rds"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "sensitive"
          + "Description" = "Shared MySQL database for multiple services"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "master-password-secret-name-export"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Project"     = "shared-infrastructure"
          + "Service"     = "shared-database"
          + "Stack"       = "rds"
          + "Team"        = "platform-team"
        }
      + tags_all       = {
          + "Component"   = "rds"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "sensitive"
          + "Description" = "Shared MySQL database for multiple services"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "master-password-secret-name-export"
          + "Owner"       = "platform-team@ryuqqq.com"
          + "Project"     = "shared-infrastructure"
          + "Service"     = "shared-database"
          + "Stack"       = "rds"
          + "Team"        = "platform-team"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

Plan: 5 to add, 1 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p rds-prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.set-of.com/lock?id=ryu-qqq%252FInfrastructure%252Fterraform%252Frds%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p rds-prod
  ```
Plan: 5 to add, 1 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```